app/controllers/application_controller.rb

SELECT "access_tokens".* FROM "access_tokens" WHERE "access_tokens"."token" = ? LIMIT ?  [["token", "{{access_token}}"], ["LIMIT", 1]]
---
  def access_token
    # request is an Object accesible in all controllers
    # having a method authoirzation returning the value
    # of the request header with the same name

    # If the authentication is invalid, use safe operator &
    # to return nil instead of raising an exception
    provided_token = request.authorization&.gsub(/\ABearer\s/, '')
    @access_token = AccessToken.find_by(token: provided_token)