app/controllers/comments_controller.rb

  def index
    comments = @article.comments
      .page(params[:page])
      .per(params[:per_page])
---
SELECT "comments".* FROM "comments" WHERE "comments"."article_id" = ? LIMIT ? OFFSET ?  [["article_id", 1], ["LIMIT", 25], ["OFFSET", 0]]

  def load_article
    @article = Article.find(params[:article_id])
---
SELECT "articles".* FROM "articles" WHERE "articles"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]